tests/adspygoogle/dfa/data/integration_test_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsd3="http://www.w3.org/2001/XMLSchema"
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi3="http://www.w3.org/2001/XMLSchema-instance"
>
<SOAP-ENV:Header>
<Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<UsernameToken>
<Username xsi3:type="xsd3:string">%(username)s</Username>
<Password xsi3:type="xsd3:string">%(token)s</Password>
</UsernameToken>
</Security>
<RequestHeader>
<applicationName>%(appName)s %(libSig)s</applicationName>
</RequestHeader>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<ns1:getPlacementTypes xmlns:ns1="http://www.doubleclick.net/dfa-api/%(version)s" xmlns="http://www.doubleclick.net/dfa-api/%(version)s"></ns1:getPlacementTypes>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
